<?php

return [
    'singular' => 'المكتب الهندسي',
    'plural' => 'المكاتب الهندسية',
    'empty' => 'لا يوجد مكاتب هندسية حتى الان',
    'count' => 'عدد المكاتب الهندسية',
    'search' => 'بحث',
    'select' => 'اختر المكتب الهندسي',
    'permission' => 'ادارة المكاتب الهندسية',
    'trashed' => 'المكاتب الهندسية المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن مكتب هندسي',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة مكتب هندسي',
        'show' => 'عرض المكتب الهندسي',
        'edit' => 'تعديل المكتب الهندسي',
        'delete' => 'حذف المكتب الهندسي',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المكتب الهندسي بنجاح.',
        'updated' => 'تم تعديل المكتب الهندسي بنجاح.',
        'deleted' => 'تم حذف المكتب الهندسي بنجاح.',
        'restored' => 'تم استعادة المكتب الهندسي بنجاح.',
    ],
    'attributes' => [
        
        'name' => 'اسم المكتب الهندسي',
        '%name%' => 'اسم المكتب الهندسي',
'%description%' => 'وصف',
'description' => 'وصف',
        'image' => 'صورة المكتب الهندسي',
'email'=>'الايميل',
'phone'=>'رقم الهاتف',
'city_id'=>'المدينة',

    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المكتب الهندسي ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة المكتب الهندسي ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المكتب الهندسي نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
