<?php

return [
    'singular' => 'المدينة',
    'plural' => 'الاعلانات',
    'empty' => 'لا يوجد اعلانات حتى الان',
'city'=>'مدينة رئسية',
    'levels' => [
        '0' => 'المدينة',
        '1' => 'المنطقة',
        '2' => 'الحي',
    ],
    'count' => 'عدد المدن',
    'search' => 'بحث',
    'select' => 'اختر المدينة',
    'permission' => 'ادارة الاعلانات',
    'trashed' => 'المدن المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن مدينة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة مدينة',
        'show' => 'عرض المدينة',
        'edit' => 'تعديل المدينة',
        'delete' => 'حذف المدينة',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المدينة بنجاح.',
        'updated' => 'تم تعديل المدينة بنجاح.',
        'deleted' => 'تم حذف الاعلان بنجاح.',
        'restored' => 'تم استعادة المدينة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم المدينة',
        '%name%' => 'اسم المدينة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الاعلان ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة المدينة ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المدينة نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
